Revit 2026 API

# RebarShapeConstraintAngleFromFixedDir Properties

---

The RebarShapeConstraintAngleFromFixedDir type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Direction | A fixed direction in UV-space. The parameter will drive the segment's angle relative to this direction. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RebarShapeConstraint) |
|  | Sign | When the sign is 1, the Direction is rotated clockwise by the angle's value. When -1, the Direction is rotated counter-clockwise. |

#### Reference

RebarShapeConstraintAngleFromFixedDir Class

Autodesk.Revit.DB.Structure Namespace